# Переменная
Переменную можно просто объявить.
Объявление предоставляет основные свойства символа: его тип и его название.
Без присвоения начального значения переменная просто объявлена, а с начальным значением она еще инициализирована.
При объявлении переменной (например, int a; ) ей выделяется память, если переменную не инициализировать,
то значение переменной будет равно тому мусору, который был в памяти до этого.
Объявление используется, чтобы уведомить компилятор о существовании элемента.
Компиля́тор — программа, переводящая написанный на языке программирования текст в набор машинных кодов.